# *****************************************************************************************
# импорт основного окна App
from kivy.app import App
# импорт модуля Коробочный макет
# в него будем пихать кнопки и др. GUI элементы
from kivy.uix.boxlayout import BoxLayout
# импорт модуля Кнопка
from kivy.uix.button import Button
# импорт модуля Ввод Текста
from kivy.uix.textinput import TextInput
# listdir - показывает файлы в конкретной папке
from os import listdir
# импорт модуля Строитель - загружает .kv файлы в проект
from kivy.lang import Builder
# записываем директорию в переменную kv_path
kv_path = './013/'
# загрузить все файлы .kv по отдельности
for kv_file in listdir(kv_path):
    Builder.load_file(kv_path + kv_file)
# *****************************************************************************************
class Calc(App):
    def build(self):
        return super().build()
# *****************************************************************************************
# если программа не модуль, то выполнить
if __name__ == '__main__':
    # запускаем приложение
    Calc().run()
# *****************************************************************************************