# *****************************************************************************************
# Перевод килограммов в граммы
# *****************************************************************************************
# главное окно программы
from kivy.app import App
# коробочный макет
from kivy.uix.boxlayout import BoxLayout
# свойства объекта (виджета)
from kivy.properties import ObjectProperty
# *****************************************************************************************
# конфигурация приложения kv
from kivy.config import Config
# задаем размеры окна статически
Config.set('graphics', 'width', '400')
Config.set('graphics', 'height', '60')
# *****************************************************************************************
# Работа с директориями и файлами ОС
from os.path import dirname, join
# Работа с директориями и файлами ОС
from pathlib import Path
# Класс Builder - закрузчик языка KV Lang
from kivy.lang import Builder
Builder.load_file(str(Path(join(dirname(__file__), './convert.kv'))))
# *****************************************************************************************
# Перед созданием данного приложения давайте сначало подумаем 
# какие виджеты нам понадобятся. А понадобятся нам:
# 1. Горизонтальный макет BoxLayout(у нас будет класс KgWeight наследоваться 
# от класса BoxLayout)
# 2. Виджет Text Input для ввода значения в кг
# 3. Виджет Label для отображения '='
# 4. Виджет Label для отображения грамм
# Итак создадим два файла kgapp.py для кода и kg.kv для разметки. 
# В коде для начала зададим размер окна 400х60 с помощью Config.set
# *****************************************************************************************
class Convert(BoxLayout):
    # ---------------------------------------------------------------------------
    '''app widget'''
    # ---------------------------------------------------------------------------
    # vars
    # ---------------------------------------------------------------------------
    # methods
    # ---------------------------------------------------------------------------
    pass
    # ---------------------------------------------------------------------------
# *****************************************************************************************
class ConvertApp(App):
    # ---------------------------------------------------------------------------
    '''app widget'''
    # ---------------------------------------------------------------------------
    def build(self):
        return Convert()
    # ---------------------------------------------------------------------------
# *****************************************************************************************
# запуск программы
if __name__ == '__main__':
    ConvertApp().run()
# *****************************************************************************************