# *****************************************************************************************
# Настройка размера экрана
# Есть два способа задать размер окна. 
# Первый способ это перед созданием приложения. 
# Импортируем класс Config из модуля kivy.config:
# *****************************************************************************************
# главное окно программы
from kivy.app import App
# коробочный макет
from kivy.uix.boxlayout import BoxLayout
# конфигурация главного окна программы
from kivy.config import Config
# *****************************************************************************************
# У класса Config вызываем метод set 
# и первым параметром пишем к чему обращаемся 
# в данном случае к graphics
# Устанавливаем width(ширину) и height(длину) 
# в 100 пикселей
Config.set('graphics', 'width', '400')
Config.set('graphics', 'height', '300')
# Так же можно запретить или разрешить растягивания экрана 
# для этого также обращаемся к "graphics" и к параметру "resizable". 
# И третим параметром пишем "True" (разрешить растягивание) 
# или "False" чтобы запретить растягивание.
Config.set('graphics','resizable',False)
# *****************************************************************************************
# окно программы
class TestApp(App):
    # ---------------------------------------------------------------------------
    def build(self):
        bl = BoxLayout()
        return bl
    # ---------------------------------------------------------------------------
# *****************************************************************************************
# запуск программы
if __name__ == '__main__':
    TestApp().run()
# *****************************************************************************************