# *****************************************************************************************
# Атрибут id
# *****************************************************************************************
# главное окно программы
from kivy.app import App
# коробочный макет
from kivy.uix.boxlayout import BoxLayout
# свойства объекта (виджета)
from kivy.properties import ObjectProperty
# Работа с директориями и файлами ОС
from os.path import dirname, join
# Работа с директориями и файлами ОС
from pathlib import Path
# Класс Builder - закрузчик языка KV Lang
# Вызов - вариант 1
# from kivy.lang.builder import Builder
# Вызов - вариант 2
from kivy.lang import Builder
# *****************************************************************************************
# Создадим файл builder_app.py и загрузим нашу разметку example.kv 
# с помощью метода load_file и присвоем переменной example_kv:
# kv_file = Builder.load_file(str(Path(join(dirname(__file__), './005 - id.kv'))))
Builder.load_file(str(Path(join(dirname(__file__), './005 - id.kv'))))
# *****************************************************************************************
# Разберем этот код по порядку. В этом коде мы создаем 
# класс TestId который наследуется от BoxLayout и который 
# так же называется у нас в разметке в треугольных скобках. 
# Далее нашим переменным text_input и label
# (такие же навзания переменных должны быть в разметке) 
# присваиваем ObjectProperty(None) который находится в 
# модуле kivy.properties(в этом модуле находятся классы разных 
# свойств в данном примере мы используем класс свойство 
# объекта(ObjectProperty)). Далее создаем метод enter_text и 
# пишем в нем код который присваивает текст из виджета 
# Text Input виджету Label используя созданные нами переменные. 
# В самой разметке у TextInput событию on_text_validate мы 
# присваиваем метод enter_text перед этим написав root, 
# то есть обращаясь как бы к классу TestId и получается 
# root.enter_text(). Так же поставьте атрибут multiline 
# в значение False у TextInput чтобы при нажатии клавиши 
# Enter вместо перехода на новую строку заканчивался ввод текста
class TestId(BoxLayout):
    # ---------------------------------------------------------------------------
    '''root widget'''
    # ---------------------------------------------------------------------------
    # vars
    text_input = ObjectProperty()
    label = ObjectProperty()
    # ---------------------------------------------------------------------------
    # methods
    def enter_text(self):
        self.label.text = self.text_input.text
        # или (тогда ObjectProperty можно не объявлять)
        # self.ids.label.text = self.ids.text_input.text
    # ---------------------------------------------------------------------------
    pass
    # ---------------------------------------------------------------------------
# *****************************************************************************************
class IdApp(App):
    # ---------------------------------------------------------------------------
    '''app widget'''
    # ---------------------------------------------------------------------------
    def build(self):
        test_id = TestId()
        return test_id

        # можно и по другому возвращать
        # тогда kv файл должен быть:
        #
        # TestId:
        #     text_input: text_input
        #     label: label
        #     orientation: 'horizontal'
        #     TextInput:
        #         id: text_input
        #         multiline: False
        #         on_text_validate: root.enter_text()
        #     Label:
        #         id: label
        #
        # return Builder.load_file(str(Path(join(dirname(__file__), './005 - id.kv'))))
        # return Builder.load_file('./005 - id.kv')
        # а твк будет ошибка
        # return kv_file
    # ---------------------------------------------------------------------------
# *****************************************************************************************
# запуск программы
if __name__ == '__main__':
    IdApp().run()
# *****************************************************************************************