# *****************************************************************************************
# Наследование классов в Kv Design Language
# *****************************************************************************************
# главное окно программы
from kivy.app import App
# коробочный макет
from kivy.uix.boxlayout import BoxLayout
# свойства объекта (виджета)
from kivy.properties import ObjectProperty
# Работа с директориями и файлами ОС
from os.path import dirname, join
# Работа с директориями и файлами ОС
from pathlib import Path
# Класс Builder - закрузчик языка KV Lang
# Вызов - вариант 1
# from kivy.lang.builder import Builder
# Вызов - вариант 2
from kivy.lang import Builder
# *****************************************************************************************
Builder.load_file(str(Path(join(dirname(__file__), './006 - container.kv'))))
Builder.load_file(str(Path(join(dirname(__file__), './006 - example.kv'))))
# *****************************************************************************************
# В языке разметки Kivy мы можем наследоваться от друго класса 
# и использовать наш наследованный класс в другой разметке. 
# Чтобы наследоваться от другого класса в разметке после 
# названия класса поставьте @ и название класса от которого 
# хотите наследоваться. Рассмотрим на примере. 
# Создадим три файла example.py для кода, example.kv 
# для основной разметки и container.kv в этой разметке мы 
# создадим класс Container и он будет наследоваться 
# от класса BoxLayout прямо в разметке. Опишем сначала container.kv
# *****************************************************************************************
# Здесь мы импортируем класс Builder и с помощью метода load_file 
# загружаем нашу дополнительную разметку container.kv для того 
# чтобы основная разметка example.kv видела этот класс. 
# Далее в коде мы создаем класс Example и наследуемся от BoxLayout. 
# В ExampleApp создаем экземпляр класса Example. При запуске 
# приложения вы увидите три кнопки который мы написали в разметке 
# container.kv, а в разметке example.kv описали только класс Container
class Example(BoxLayout):
    # ---------------------------------------------------------------------------
    '''root widget'''
    # ---------------------------------------------------------------------------
    # vars
    # ---------------------------------------------------------------------------
    # methods
    # ---------------------------------------------------------------------------
    pass
    # ---------------------------------------------------------------------------
# *****************************************************************************************
class InheritanceApp(App):
    # ---------------------------------------------------------------------------
    '''app widget'''
    # ---------------------------------------------------------------------------
    def build(self):
        # example = Example()
        # return example
        return Example()
    # ---------------------------------------------------------------------------
# *****************************************************************************************
# запуск программы
if __name__ == '__main__':
    InheritanceApp().run()
# *****************************************************************************************