# *****************************************************************************************
# импорт основного окна App
from kivy.app import App
# импорт модуля Коробочный макет
# в него будем пихать кнопки и др. GUI элементы
from kivy.uix.boxlayout import BoxLayout
# импортируем модуль Свойство Цвета Объекта 
# для работы с переменными (свойствами) KV файлав
from kivy.properties import ColorProperty
# импорт модуля Строитель - загружает .kv файлы в проект
from kivy.lang import Builder
Builder.load_file('./020/BoxLayoutDecor.kv')
# *****************************************************************************************
# создаем основное окно программы, наследуя App - основные свойства окна
class Programm(App):
    # создаем стандартный конструктор Kivy: build(self)
    def build(self):
        # встраиваем дизайн и функционал основного окна
        # return BoxLayoutDecor(background_color = (1, 0, 1, 1))
        return BoxLayoutDecor()
# *****************************************************************************************
# декоратор - коробочный макет
class BoxLayoutDecor(BoxLayout):
    # доступ с переменным и свойствам класса в KV файлах
    background_color = ColorProperty()
    # задаем цвет фона (белый) корневого BoxLayout
    background_color = (1, 1, 1, 1)
    pass

# *****************************************************************************************
# если программа не модуль, то выполнить
if __name__ == '__main__':
    # запускаем приложение
    Programm().run()
# *****************************************************************************************