# *****************************************************************************************
# Простой чат
# *****************************************************************************************
# client.py - пользовательский интерфейс для общения в чате
# *****************************************************************************************
# Напишем простой чат. Напишем два файла python server.py и client.py.
# Файл server.py не будет иметь пользовательского интерфейса. 
# Это простой сервер который будет принимать подключения от клиентов и сообщения. 
# От клиента будет приходить сообщения на сервер а сервер перешлет 
# это сообщения всем подлкюченным клиентам.
# Файл client.py будет иметь пользовательский интерфейс который мы напишем на Kivy. 
# Мы будем использовать модуль socket. В server.py мы напишем сокет к которому 
# привяжем ip и port чтобы клиенту могли по этому ip и port подключаться. 
# Так же напишем чтобы сокет постоянно прослушивал входящие сообщения 
# от клиентов и отправлял их всем клиентам
# В client.py мы напишем чтобы сокет подключался по протоколу TCP и подключался 
# по тому ip и port который у сервера. И так же напишем чтобы этот же сокет 
# принимал сообщения от сервера и выводил их в Label с сообщениями. 
# Так же будут приходить от сервера сообщения кто подключился к чату 
# и кто вышел из чата
# Сначало напишем файл sever.py. 
# Импоритруем два модуля socket и threading
# *****************************************************************************************
# Теперь напишем файл client.py. В этом файле мы будем использовать Kivy. 
# Так же импортируем модули socket и threading
# *****************************************************************************************
# socket - работа с TCP/IP и сетью в целом
import socket
# threading - работа с потоками
import threading
# *****************************************************************************************
# Далее импортируем класс App и классы виджетов Kivy
# *****************************************************************************************
# главное окно программы
from kivy.app import App
# коробочный макет
from kivy.uix.boxlayout import BoxLayout
# плавающий макет
from kivy.uix.floatlayout import FloatLayout
# текст
from kivy.uix.label import Label
# ввод текста
from kivy.uix.textinput import TextInput
# кнопка
from kivy.uix.button import Button
# *****************************************************************************************
# Далее импортируем из модуля graphics два класса Color и Rectangle. 
# Они нужны нам чтобы нарисовать прямоугольник заданного цвета.Мы будем рисовать 
# его где будет находиться Label со списком пользователей
# *****************************************************************************************
# импортируем класс Color (цвет) и Rectangle (прямоугольник).
# они нужны нам для того чтоы изменить цвет у области
# где будет Label списка пользователей
from kivy.graphics import Color, Rectangle
# *****************************************************************************************
# Импортируем виджет ScrollView для прокрутки Label c сообщениями. 
# Там же импортируем свойство для строк StringProperty
# *****************************************************************************************
# виджет для прокрутки
from kivy.uix.scrollview import ScrollView
# свойства объекта (виджета)
# ObjectProperty - свойство для оббъекта
# StringProrerty - свойство для строк
from kivy.properties import ObjectProperty, StringProrerty
# *****************************************************************************************





# работа с аудио
from kivy.core.audio import SoundLoader
# работа с настройками основного окна программы
from kivy.core.window import Window
# *****************************************************************************************
# поток таймер
# from threading import Timer as timer
from threading import Timer
# *****************************************************************************************
# конфигурация приложения kv
from kivy.config import Config
# задаем размеры окна статически
# Config.set('graphics', 'width', '400')
# Config.set('graphics', 'height', '500')
# *****************************************************************************************
# Работа с директориями и файлами ОС
from os.path import dirname, join
# Работа с директориями и файлами ОС
from pathlib import Path
# Класс Builder - закрузчик языка KV Lang
from kivy.lang import Builder
# Builder.load_file(str(Path(join(dirname(__file__), './AudioPlayer.kv'))))
# *****************************************************************************************
# сторонние модули
# *****************************************************************************************
# динамическое изменение основного окна
# Зададим размер окна 400x400 c помошью атрибута size у класса Window
Window.size = (400, 400)
# *****************************************************************************************
class Chat(BoxLayout):
    # ---------------------------------------------------------------------------
    '''root widget'''
    # ---------------------------------------------------------------------------
    # vars
    # ---------------------------------------------------------------------------
    # methods
    # ---------------------------------------------------------------------------
    pass
    # ---------------------------------------------------------------------------
    pass
    # ---------------------------------------------------------------------------
# *****************************************************************************************
class ChatApp(App):
    # ---------------------------------------------------------------------------
    '''app widget'''
    # ---------------------------------------------------------------------------
    # vars
    # ---------------------------------------------------------------------------
    # methods
    # ---------------------------------------------------------------------------
    def build(self):
        return Chat()
    # ---------------------------------------------------------------------------
# *****************************************************************************************
# запуск программы
if __name__ == '__main__':
    ChatApp().run()
# *****************************************************************************************