# *****************************************************************************************
# Простой чат
# *****************************************************************************************
# главное окно программы
from kivy.app import App
# коробочный макет
from kivy.uix.boxlayout import BoxLayout
# свойства объекта (виджета)
from kivy.properties import ObjectProperty
# *****************************************************************************************
# работа с аудио
from kivy.core.audio import SoundLoader
# работа с настройками основного окна программы
from kivy.core.window import Window
# *****************************************************************************************
# поток таймер
# from threading import Timer as timer
from threading import Timer
# *****************************************************************************************
# конфигурация приложения kv
from kivy.config import Config
# задаем размеры окна статически
# Config.set('graphics', 'width', '400')
# Config.set('graphics', 'height', '500')
# *****************************************************************************************
# Работа с директориями и файлами ОС
from os.path import dirname, join
# Работа с директориями и файлами ОС
from pathlib import Path
# Класс Builder - закрузчик языка KV Lang
from kivy.lang import Builder
# Builder.load_file(str(Path(join(dirname(__file__), './AudioPlayer.kv'))))
# *****************************************************************************************
# сторонние модули
# *****************************************************************************************
# динамическое изменение основного окна
# Зададим размер окна 400x400 c помошью атрибута size у класса Window
Window.size = (400, 400)
# *****************************************************************************************
class Chat(BoxLayout):
    # ---------------------------------------------------------------------------
    '''root widget'''
    # ---------------------------------------------------------------------------
    # vars
    # ---------------------------------------------------------------------------
    # methods
    # ---------------------------------------------------------------------------
    pass
    # ---------------------------------------------------------------------------
    pass
    # ---------------------------------------------------------------------------
# *****************************************************************************************
class ChatApp(App):
    # ---------------------------------------------------------------------------
    '''app widget'''
    # ---------------------------------------------------------------------------
    # vars
    # ---------------------------------------------------------------------------
    # methods
    # ---------------------------------------------------------------------------
    def build(self):
        return Chat()
    # ---------------------------------------------------------------------------
# *****************************************************************************************
# запуск программы
if __name__ == '__main__':
    ChatApp().run()
# *****************************************************************************************