# *****************************************************************************************
# Slider
# Модуль: kivy.uix.slider

# Slider - виджет у которого ползунок можно передвигать 
    # от минимального до максимального значения.

# Атрибуты
# orientation - принимает значение "horizontal"(горизонтальное положение) 
    # или "vertical"(вертикальное положение).
# min - минимальное допустимое значение.
# max - максимальное допустимое значение.
# value - текущее используемое значения для слайдера. По умолчанию 0.
# step - размер шага слайдера. По умолчанию 1.

# События
# on_touch_down - при нажатии на область слайдера
# on_touch_up - при отпускании нажатии на область слайдера
# on_touch_move - при перемещении ползунка слайдера

# Пример
# Создадим приложение где при перетаскивания ползунка на слайдере будет 
# записываться его значение в Label:
# *****************************************************************************************
# главное окно программы
from kivy.app import App
# коробочный макет
from kivy.uix.boxlayout import BoxLayout
# виджет - ползунок
from kivy.uix.slider import Slider
# текст
from kivy.uix.label import Label
# *****************************************************************************************
# окно программы
class SliderApp(App):
    # ---------------------------------------------------------------------------
    def build(self):
        self.bl = BoxLayout(orientation='vertical')
        # self.sl = Slider(min=10, max=80, value=15, step=1)
        self.sl = Slider(min=10, max=80, value=15)
        # self.lb = Label(text=str(self.sl.value), font_size='70sp')
        self.lb = Label(text=str(int(self.sl.value)), font_size='70sp')
        self.sl.bind(value=self.on_value)
        self.bl.add_widget(self.sl)
        self.bl.add_widget(self.lb)
        return self.bl
    # ---------------------------------------------------------------------------
    def on_value(self, instance, value):
        # self.lb.text = str(self.sl.value)
        self.lb.text = str(int(self.sl.value))
    # ---------------------------------------------------------------------------
# *****************************************************************************************
# запуск программы
if __name__ == '__main__':
    SliderApp().run()
# *****************************************************************************************