# *****************************************************************************************
# FileChooser
# Модуль: kivy.uix.filechooser

# FileChooser - файловый менеджер
# FileChooserOpenSave - модальные окна для открытия и сохрания файлов
# *****************************************************************************************
# главное окно программы
from kivy.app import App
# Плавающий макет
from kivy.uix.floatlayout import FloatLayout
# Регистрация и использование объектов
from kivy.factory import Factory
# Свойства объектов
from kivy.properties import ObjectProperty
# Модальные всплывающие окна
from kivy.uix.popup import Popup

# Коробочный макет
from kivy.uix.boxlayout import BoxLayout
# кнопка
from kivy.uix.button import Button
# окно выбора файлов
from kivy.uix.filechooser import FileChooser

# Работа с файлами и директориями
import os
# *****************************************************************************************
# Окно - загрузить файл
class LoadDialog(FloatLayout):
    # ---------------------------------------------------------------------------
    # vars - ObjectProperty
    load = ObjectProperty(None)
    cancel = ObjectProperty(None)
    # ---------------------------------------------------------------------------
# *****************************************************************************************
# Окно - сохранить файл
class SaveDialog(FloatLayout):
    # ---------------------------------------------------------------------------
    # vars - ObjectProperty
    save = ObjectProperty(None)
    text_input = ObjectProperty(None)
    cancel = ObjectProperty(None)
    # ---------------------------------------------------------------------------
# *****************************************************************************************
# Дизайн окна программы
class Root(FloatLayout):
    # ---------------------------------------------------------------------------
    """
    app widget
    """
    # ---------------------------------------------------------------------------
    # vars - ObjectProperty
    loadfile = ObjectProperty(None)
    savefile = ObjectProperty(None)
    text_input = ObjectProperty(None)
    # ---------------------------------------------------------------------------
    pass
# *****************************************************************************************
# окно программы
class Editor(App):
    # ---------------------------------------------------------------------------
    """
    root widget
    """
    # ---------------------------------------------------------------------------
    # def build(self):
    #     return Root()
    # """
    # kv file должет выглядеть так:
    # <Root>:
    #     code 
    #     ...
    #     code
    # """
    # ---------------------------------------------------------------------------
    pass
# *****************************************************************************************
# запуск программы
if __name__ == '__main__':
    Editor().run()
# *****************************************************************************************